Revit 2027 API
MechanicalEquipmentSet.AreValidMembers Method
 Checks if these are valid members for mechanical equipment set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreValidMembers(
	Document document,
	ISet<ElementId> memberIds
)
Public Shared Function AreValidMembers (
	document As Document,
	memberIds As ISet(Of ElementId)
) As Boolean
public:
static bool AreValidMembers(
	Document^ document,
	ISet<ElementId^>^ memberIds
)
static member AreValidMembers :
        document : Document *
        memberIds : ISet<ElementId> -> bool
Parameters
document Document
 The document of the member elements.
memberIds ISet<ElementId>
 The member element ids.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace